app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-12-02 13:23:38.136767"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    # raise params.inspect
    Article.update(title: params[:article][:title], description: params[:article][:description])